InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРасчетаАванса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаАванса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтТарифа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетомЗаПервуюПоловинуМесяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШтатноеРасписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШтатноеРасписание</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиВидаРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиВидаРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЕжегодныеОтпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЕжегодногоОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специальности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЯЯ_Доработки/Ext/Module.bsl
Функция ПолучитьПредопределенныйОбъект(Параметр, Родитель = Неопределено) Экспорт
	
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Наименование = Параметр;
		Ссылка = Справочники.Я_ПредопределенныеОбъекты.НайтиПоНаименованию(Наименование, Истина, Родитель);
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Я_ПредопределенныеОбъекты") Тогда
		Наименование = Параметр.Наименование;
		Ссылка = Параметр;
	КонецЕсли;
	
	Если НЕ ЯЯ_Доработки.Выбрано(Ссылка) Тогда
		Сообщить("ВНИМАНИЕ! Не найден предопределенный объект " + Наименование + " - сообщите разработчикам!", СтатусСообщения.Внимание);
	ИначеЕсли НЕ ЯЯ_Доработки.Выбрано(Ссылка.Объект) Тогда
		Сообщить("ВНИМАНИЕ! Не найден предопределенный объект " + Наименование + " - сообщите разработчикам!", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат Ссылка.Объект;
	
КонецФункции

// Функция - аналог использования функции ЗначениеЗаполнено с модификацией
//
// Параметры:
//  Значение			 - Объект проверки
//  ТекстПредупреждения	 - Текст предупреждения для пользователей
//  НомерСтроки			 - Номер строки проверки
//  Отказ				 - Отказ
//  Предупреждать		 - Признак вывода предупреждения или сообщения (Истина вызывает метод Предупредить(); Ложь вызывает метод Сообщить() )
// 
// Возвращаемое значение:
//  Результат - Истина/Ложь
//
Функция Выбрано(Значение, ТекстПредупреждения = Неопределено, НомерСтроки = 0, Отказ = Ложь, Предупреждать = Ложь) Экспорт
	
	Результат = Истина;
	ТипЗначения = ТипЗнч(Значение);
	
	// Сначала примитивные типы
	Если Значение = Неопределено ИЛИ Значение = NULL Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗначения=Тип("Булево") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения=Тип("Число") 
		Тогда Если Значение = 0 Тогда 
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		Если СокрЛП(Значение)="" Тогда
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("Дата") Тогда
		Если Значение=Дата('00010101') Тогда
			Результат = Ложь;
		КонецЕсли;
		#Если Клиент Тогда
		ИначеЕсли ТипЗначения = Тип("ПолеВвода") И НЕ Выбрано(Значение.Значение) Тогда
			Результат = Ложь;
		#КонецЕсли
		
		// Для остальных будем считать значение пустым, если оно равно дефолтному значению своего типа
	Иначе
		Попытка
			Если Значение = Новый(ТипЗначения) Тогда
				Результат = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		Если ТекстПредупреждения <> Неопределено тогда
			#Если Клиент Тогда
				Если Предупреждать тогда
					ПоказатьПредупреждение(, "Не заполнено поле '" + ТекстПредупреждения + "'" + ?(НомерСтроки=0,""," в строке № " + НомерСтроки) + " !");
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле '"+ТекстПредупреждения+"'"+?(НомерСтроки=0,""," в строке № "+НомерСтроки)+" !", СтатусСообщения.Важное);
				КонецЕсли;
			#КонецЕсли
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ПроцедурыФункцииОбмена

Функция ПолучитьКлючAPI()
	
	Возврат "e2443c1597c75e1cf334959b436d12ab";
	
КонецФункции

Функция ПолучитьШтатноеРасписание(Строка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	ШтатноеРасписание.Подразделение = &Подразделение
	|	И ШтатноеРасписание.Должность = &Должность
	|	И ШтатноеРасписание.Владелец = &Организация");
	Подразделение = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.УИД_ПодразделениеОрганизации));
	Должность = Справочники.Должности.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.УИД_Должность));
	Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.УИД_Организация));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Должность",Должность);
	Запрос.УстановитьПараметр("Организация",Организация);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 1 Тогда //штатна одиниця може бути одна
		Возврат Рез[0].Ссылка
	ИначеЕсли Рез.Количество() = 0 Тогда //треба створити нову
		НовШтатРасп = Справочники.ШтатноеРасписание.СоздатьЭлемент();
		НовШтатРасп.Подразделение = Подразделение;
		НовШтатРасп.Должность = Должность;  
		НовШтатРасп.Владелец = Организация;
		//можливо треба допрацювати отримання найменування
		НовШтатРасп.Наименование = УправлениеШтатнымРасписаниемКлиентСервер.НаименованиеПозицииШтатногоРасписания(
		Подразделение,
		Должность);
		// 
		НовШтатРасп.Записать(); 
		Возврат НовШтатРасп.Ссылка;
	КонецЕсли;
КонецФункции

Функция ДатаJsonВЗнач(JsonДата) 
	Если ЗначениеЗаполнено(JsonДата) Тогда
		СтрокаДата = СтрЗаменить(JsonДата, "-", "");
		СтрокаДата = СтрЗаменить(СтрокаДата, ":", "");
		СтрокаДата = СтрЗаменить(СтрокаДата, "T", "");
		Дата = Дата(Лев(СтрокаДата, 14));
	Иначе
		Дата = Дата("00010101");
	КонецЕсли;
	Возврат Дата;
КонецФункции

Функция ПоличитьРеквизитыИзСтруктуры(Строка, ПрефиксРеквизитов)
	СтруктураЗаполнения = Новый Структура;
	Для каждого Элемента из Строка Цикл
		ПоискПрефикса = СтрНайти(Элемента.Ключ, ПрефиксРеквизитов);
		Если ПоискПрефикса>0 Тогда
			СтруктураЗаполнения.Вставить(СтрЗаменить(Элемента.Ключ,ПрефиксРеквизитов,""), Элемента.Значение);
			Если СтрНайти(Элемента.Ключ, "Дата")>0 Тогда  
				СтруктураЗаполнения[СтрЗаменить(Элемента.Ключ,ПрефиксРеквизитов,"")] = ДатаJsonВЗнач(СтруктураЗаполнения[СтрЗаменить(Элемента.Ключ,ПрефиксРеквизитов,"")]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураЗаполнения;
КонецФункции

Процедура ЗаполнитьОбновитьФизЛицо(строка, ФизЛицо, ЗаголовокСтруктуры)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, ЗаголовокСтруктуры);
	ЗаполнитьЗначенияСвойств(ФизЛицо,СтруктураРеквизитов);
	//створити ієрархію спочатку верхній рівень
	Если СтрДлина(СтруктураРеквизитов["РодительРодитель"]) Тогда
		РодительРодитель = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураРеквизитов["УИД_РодительРодитель"]));
		Если РодительРодитель.ПолучитьОбъект() = Неопределено Тогда
			//создать новый
			НовРодительРодитель = Справочники.ФизическиеЛица.СоздатьГруппу();
			НовРодительРодитель.УстановитьСсылкуНового(РодительРодитель);
			НовРодительРодитель.Код = СтруктураРеквизитов["РодительРодительКод"];
			НовРодительРодитель.Наименование = СтруктураРеквизитов["РодительРодитель"];
			НовРодительРодитель.Записать();
		Иначе
			//использовать существующий
		КонецЕсли;
	КонецЕсли;
	//і рівень нижче
	Если СтрДлина(СтруктураРеквизитов["Родитель"]) Тогда
		Родитель = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураРеквизитов["УИД_Родитель"]));
		Если Родитель.ПолучитьОбъект() = Неопределено Тогда
			//создать новый
			НовРодитель = Справочники.ФизическиеЛица.СоздатьГруппу();
			НовРодитель.УстановитьСсылкуНового(Родитель);
			НовРодитель.Код = СтруктураРеквизитов["РодительКод"];
			НовРодитель.Наименование = СтруктураРеквизитов["Родитель"];
			НовРодитель.Родитель = РодительРодитель;
			НовРодитель.Записать();
		Иначе
			//использовать существующий
		КонецЕсли;
		ФизЛицо.Родитель = Родитель;
	КонецЕсли;
	ФизЛицо.ФИО = СтруктураРеквизитов.Наименование;
	ФизЛицо.Пол = Перечисления.ПолФизическогоЛица[СтруктураРеквизитов.Пол];
	ФизЛицо.Записать();
	//Заполнить регистр сведений ФИО
	ФИОФизическиеЛица = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
	ФИОФизическиеЛица.ФизическоеЛицо = ФизЛицо.Ссылка;
	ФИОФизическиеЛица.Фамилия = ФизЛицо.Фамилия;
	ФИОФизическиеЛица.Имя = ФизЛицо.Имя;
	ФИОФизическиеЛица.Отчество = ФизЛицо.Отчество;
	ФИОФизическиеЛица.Период = ?(ЗначениеЗаполнено(ФизЛицо.ДатаРождения), ФизЛицо.ДатаРождения, ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений());
	ФИОФизическиеЛица.Записать();
КонецПроцедуры 

Процедура СоздатьФизЛицо(строка, ФизЛицо, ЗаголовокСтруктуры)
	НовФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
	НовФизЛицо.УстановитьСсылкуНового(ФизЛицо);
	ЗаполнитьОбновитьФизЛицо(строка, НовФизЛицо, ЗаголовокСтруктуры);
КонецПроцедуры

Процедура ЗаполнитьФизЛицо(строка, ФизЛицо, ЗаголовокСтруктуры)
	ЗаполнитьОбновитьФизЛицо(строка, ФизЛицо, ЗаголовокСтруктуры);
КонецПроцедуры

Процедура СоздатьЗаполнитьСотрудника(строка, Сотрудник)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "Сотрудник_");
	ЗаполнитьЗначенияСвойств(Сотрудник,СтруктураРеквизитов);
	Сотрудник.ФизическоеЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.УИД_Сотрудник_ФизЛицо));
	Сотрудник.ГоловнаяОрганизация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.УИД_Организация));
	Сотрудник.ГоловнойСотрудник = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Сотрудник));
	Сотрудник.Записать();
КонецПроцедуры

Процедура СоздатьСотрудника(строка, Сотрудник)
	НовСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
	НовСотрудник.УстановитьСсылкуНового(Сотрудник);
	СоздатьЗаполнитьСотрудника(строка, НовСотрудник);
КонецПроцедуры

Процедура ЗаполнитьСотрудника(строка, Сотрудник)
	СоздатьЗаполнитьСотрудника(строка, Сотрудник);
КонецПроцедуры

Процедура СоздатьЗаполнитьДолжность(строка, Должность, ЗаголовокСтруктуры)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, ЗаголовокСтруктуры);
	ЗаполнитьЗначенияСвойств(Должность,СтруктураРеквизитов);
	//Виключення довідкник з напередвизначених елементів - шукаємо по найменуванню
	Должность.Категория = Справочники.КатегорииДолжностей.НайтиПоНаименованию(СтруктураРеквизитов.Категория_Наименование);
	
	//треба розібратися
	Если Не Должность.ПометкаУдаления Тогда
		Должность.ВведенаВШтатноеРасписание = Истина;
		Должность.ДатаВвода = НачалоГода(ТекущаяДата());
	Иначе
		Должность.ВведенаВШтатноеРасписание = Ложь;
		Должность.ИсключенаИзШтатногоРасписания = Истина;
	КонецЕсли;
	//
	Должность.Записать();
КонецПроцедуры

Процедура СоздатьДолжность(строка, Должность,ЗаголовокСтруктуры) 
	НовДолжность = Справочники.Должности.СоздатьЭлемент();
	НовДолжность.УстановитьСсылкуНового(Должность);
	СоздатьЗаполнитьДолжность(строка, НовДолжность,ЗаголовокСтруктуры);
КонецПроцедуры

Процедура ЗаполнитьДолжность(строка, Должность,ЗаголовокСтруктуры)
	СоздатьЗаполнитьДолжность(строка, Должность,ЗаголовокСтруктуры);
КонецПроцедуры  

Процедура СоздатьЗаполнитьПодразделениеОрганизаций(строка, ПодразделениеОрганизаций)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "ПодразделениеОрганизации_");
	ЗаполнитьЗначенияСвойств(ПодразделениеОрганизаций,СтруктураРеквизитов);
	//створити ієрархію спочатку верхній рівень
	Если СтрДлина(СтруктураРеквизитов["РодительРодитель"]) Тогда
		РодительРодитель = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураРеквизитов["УИД_РодительРодитель"]));
		Если РодительРодитель.ПолучитьОбъект() = Неопределено Тогда
			//создать новый
			НовРодительРодитель = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
			НовРодительРодитель.УстановитьСсылкуНового(РодительРодитель);
			НовРодительРодитель.Код = СтруктураРеквизитов["РодительРодительКод"];
			НовРодительРодитель.Наименование = СтруктураРеквизитов["РодительРодитель"];
			НовРодительРодитель.ПометкаУдаления = СтруктураРеквизитов["РодительРодитель_ПометкаУдаления"];
			НовРодительРодитель.Владелец = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка["УИД_ПодразделениеОрганизации_РодительРодительВладелец"]));
			
			//треба розібратися
			Если Не НовРодительРодитель.ПометкаУдаления Тогда
				НовРодительРодитель.Сформировано = Истина;
				НовРодительРодитель.ДатаСоздания = НачалоГода(ТекущаяДата()); 
			Иначе
				НовРодительРодитель.Расформировано = Истина;
			КонецЕсли;
			//
			
			НовРодительРодитель.Записать();
		Иначе
			//использовать существующий
		КонецЕсли;
	КонецЕсли;
	//і рівень нижче
	Если СтрДлина(СтруктураРеквизитов["Родитель"]) Тогда
		Родитель = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураРеквизитов["УИД_Родитель"]));
		Если Родитель.ПолучитьОбъект() = Неопределено Тогда
			//создать новый
			НовРодитель = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
			НовРодитель.УстановитьСсылкуНового(Родитель);
			НовРодитель.Код = СтруктураРеквизитов["РодительКод"];
			НовРодитель.Наименование = СтруктураРеквизитов["Родитель"];
			НовРодитель.ПометкаУдаления = СтруктураРеквизитов["Родитель_ПометкаУдаления"];
			НовРодитель.Родитель = РодительРодитель;
			НовРодитель.Владелец = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка["УИД_ПодразделениеОрганизации_РодительВладелец"]));
			
			//треба розібратися
			Если Не НовРодитель.ПометкаУдаления Тогда
				НовРодитель.Сформировано = Истина;
				НовРодитель.ДатаСоздания = НачалоГода(ТекущаяДата()); 
			Иначе
				НовРодитель.Расформировано = Истина;
			КонецЕсли;
			//
			
			НовРодитель.Записать();
		Иначе
			//использовать существующий
		КонецЕсли;
		ПодразделениеОрганизаций.Родитель = Родитель;
	КонецЕсли;
	ПодразделениеОрганизаций.Владелец = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка["УИД_ПодразделениеОрганизации_Владелец"]));
	//треба розібратися
	Если Не ПодразделениеОрганизаций.ПометкаУдаления Тогда
		ПодразделениеОрганизаций.Сформировано = Истина;
		ПодразделениеОрганизаций.ДатаСоздания = НачалоГода(ТекущаяДата());
	Иначе
		ПодразделениеОрганизаций.Расформировано = Истина;
	КонецЕсли;
	//
	ПодразделениеОрганизаций.Записать();
КонецПроцедуры

Процедура СоздатьПодразделениеОрганизаций(строка, ПодразделениеОрганизаций)
	НовПодразделенияОрганизаций = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
	НовПодразделенияОрганизаций.УстановитьСсылкуНового(ПодразделениеОрганизаций);
	СоздатьЗаполнитьПодразделениеОрганизаций(строка, НовПодразделенияОрганизаций);
КонецПроцедуры 

Процедура ЗаполнитьПодразделениеОрганизаций(строка, ПодразделениеОрганизаций)
	СоздатьЗаполнитьПодразделениеОрганизаций(строка, ПодразделениеОрганизаций);
КонецПроцедуры

Процедура СоздатьЗаполнитьНалоговуюИнспекцию(строка, НалоговаяИнспекция)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "Организация_НалоговаяИнспекция_");
	ЗаполнитьЗначенияСвойств(НалоговаяИнспекция,СтруктураРеквизитов);
	НалоговаяИнспекция.Записать();
КонецПроцедуры      

Процедура СоздатьНалоговуюИнспекцию(строка, НалоговаяИнспекция)
	НовНалоговаяИнспекция = Справочники.НалоговыеИнспекции.СоздатьЭлемент();
	НовНалоговаяИнспекция.УстановитьСсылкуНового(НалоговаяИнспекция);
	СоздатьЗаполнитьНалоговуюИнспекцию(строка, НовНалоговаяИнспекция);
КонецПроцедуры

Процедура ЗаполнитьНалоговуюИнспекцию(строка, НалоговаяИнспекция)
	СоздатьЗаполнитьНалоговуюИнспекцию(строка, НалоговаяИнспекция);
КонецПроцедуры   

Процедура СоздатьЗаполнитьОрганизацию(строка, Организация)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "Организация_");
	ЗаполнитьЗначенияСвойств(Организация,СтруктураРеквизитов);
	Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.Получить(СтруктураРеквизитов.ЮрФизЛицоПорядок);
	Если ЗначениеЗаполнено(строка.УИД_НалоговаяИнспекция) Тогда
		Организация.НалоговаяИнспекция = Справочники.НалоговыеИнспекции.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_НалоговаяИнспекция));
	КонецЕсли;
	Организация.Записать();
КонецПроцедуры  

Процедура СоздатьОрганизацию(строка, Организация)
	НовОрганизация = Справочники.Организации.СоздатьЭлемент();
	НовОрганизация.УстановитьСсылкуНового(Организация);
	СоздатьЗаполнитьОрганизацию(строка, НовОрганизация);
КонецПроцедуры

Процедура ЗаполнитьОрганизацию(строка, Организация)
	СоздатьЗаполнитьОрганизацию(строка, Организация);
КонецПроцедуры 

Процедура СоздатьЗаполнитьПользователя(строка, Пользователь)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "Ответственный_");
	ЗаполнитьЗначенияСвойств(Пользователь,СтруктураРеквизитов);
	Пользователь.ФизическоеЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Ответственный_ФизЛицо));
	Пользователь.Записать();
КонецПроцедуры

Процедура СоздатьПользователя(строка, Пользователь)
	НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовПользователь.УстановитьСсылкуНового(Пользователь);
	СоздатьЗаполнитьПользователя(строка, НовПользователь);
КонецПроцедуры

Процедура ЗаполнитьПользователя(строка, Пользователь)
	СоздатьЗаполнитьПользователя(строка, Пользователь);
КонецПроцедуры   

Процедура СоздатьЗаполнитьГрафик(строка, ГрафикРаботы)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "ГрафикРаботы_");
	ЗаполнитьЗначенияСвойств(ГрафикРаботы,СтруктураРеквизитов);
	ГрафикРаботы.Записать();
КонецПроцедуры

Процедура СоздатьГрафикРаботыСотрудников(строка, ГрафикРаботы)
	НовГрафикРаботы = Справочники.ГрафикиРаботыСотрудников.СоздатьЭлемент();
	НовГрафикРаботы.УстановитьСсылкуНового(ГрафикРаботы);
	СоздатьЗаполнитьГрафик(строка, НовГрафикРаботы);
КонецПроцедуры

Процедура ЗаполнитьГрафикРаботыСотрудников(строка, ГрафикРаботы)
	СоздатьЗаполнитьГрафик(строка, ГрафикРаботы);
КонецПроцедуры 

Процедура ПроверитьОтветственныхЛицОрганизации(строка)
	Если Число(Строка.ОтветственныеЛица_ОтветственноеЛицоПорядок)>3 Тогда
		//перечисление "ОтветственныеЛицаОрганизаций" синхронны только первые 4 элемента
		Возврат;
	КонецЕсли;
	Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Организация));
	Если Не ЗначениеЗаполнено(строка.УИД_ОтветственныеЛица_Должность) Тогда
		Должность = Справочники.Должности.ПустаяСсылка();
	Иначе		
		Должность = Справочники.Должности.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ОтветственныеЛица_Должность));
	КонецЕсли;
	ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Получить(Строка.ОтветственныеЛица_ОтветственноеЛицоПорядок);
	Если Не ЗначениеЗаполнено(строка.УИД_ОтветственныеЛица_ФизическоеЛицо) Тогда
		//означает что очистили, поставить предыдущему дату окончания
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		                      |ГДЕ
		                      |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
		                      |	И ОтветственныеЛицаОрганизаций.ДолжностьСсылка = &ДолжностьСсылка
		                      |	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец
		                      |	И ОтветственныеЛицаОрганизаций.ДатаОкончания = &ДатаОкончания");
		Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
		Запрос.УстановитьПараметр("Владелец", Организация);
		Запрос.УстановитьПараметр("ДолжностьСсылка", Должность);
		Запрос.УстановитьПараметр("ДатаОкончания", Дата('00010101'));
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() = 1 Тогда
			ОбъектОтветственныхЛиц = Рез[0].Ссылка.ПолучитьОбъект();
			ОбъектОтветственныхЛиц.ДатаОкончания = ДатаJsonВЗнач(Строка.ОтветственныеЛица_Период);
			ОбъектОтветственныхЛиц.Записать();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ФизЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ОтветственныеЛица_ФизическоеЛицо));
	ДатаНачала = ДатаJsonВЗнач(Строка.ОтветственныеЛица_Период);
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОтветственныеЛицаОрганизаций.ДолжностьСсылка = &ДолжностьСсылка
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала = &ДатаНачала
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец");
	Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ДолжностьСсылка", Должность);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда // не знайшли - створюємо
		НовОтвЛицоОрг = Справочники.ОтветственныеЛицаОрганизаций.СоздатьЭлемент();
		НовОтвЛицоОрг.Владелец = Организация;
		
		ОбъектФизЛицо = ФизЛицо.ПолучитьОбъект();
		Если ОбъектФизЛицо = Неопределено Тогда
			СоздатьФизЛицо(строка, ФизЛицо, "ОтветственныеЛица_ФизическоеЛицо_");
		Иначе
			ЗаполнитьФизЛицо(строка, ОбъектФизЛицо, "ОтветственныеЛица_ФизическоеЛицо_");
		КонецЕсли;  
		
		НовОтвЛицоОрг.ФизическоеЛицо = ФизЛицо;  

		Если ЗначениеЗаполнено(Должность) Тогда
			ОбъектДолжность = Должность.ПолучитьОбъект();
			Если ОбъектДолжность = Неопределено Тогда
				СоздатьДолжность(строка,Должность,"ОтветственныеЛица_Должность_");
			Иначе
				ЗаполнитьДолжность(строка,ОбъектДолжность,"ОтветственныеЛица_Должность_");
			КонецЕсли;   
		КонецЕсли;
		НовОтвЛицоОрг.ДолжностьСсылка = Должность;
		НовОтвЛицоОрг.Должность = Должность.Наименование;
		НовОтвЛицоОрг.ОтветственноеЛицо = ОтветственноеЛицо;
		НовОтвЛицоОрг.ДатаНачала = ДатаНачала;
		НовОтвЛицоОрг.Наименование = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(НовОтвЛицоОрг.ФизическоеЛицо, НовОтвЛицоОрг.ДатаНачала);

		НовОтвЛицоОрг.Записать();
		//Найти предыдущий и поставить дату окончания
		ЗапросПредыдущий = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                                |	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка
		                                |ИЗ
		                                |	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		                                |ГДЕ
		                                |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
		                                |	И ОтветственныеЛицаОрганизаций.ДатаНачала < &ДатаНачала
		                                |	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец
		                                |
		                                |УПОРЯДОЧИТЬ ПО
		                                |	ОтветственныеЛицаОрганизаций.ДатаНачала УБЫВ");
		ЗапросПредыдущий.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
		ЗапросПредыдущий.УстановитьПараметр("Владелец", Организация);
		ЗапросПредыдущий.УстановитьПараметр("ДатаНачала", ДатаНачала);
		РезПредыдущий = ЗапросПредыдущий.Выполнить().Выгрузить();
		Если РезПредыдущий.Количество() = 1 Тогда
			ПредыдущийОбъект = РезПредыдущий[0].Ссылка.ПолучитьОбъект();
			ПредыдущийОбъект.ДатаОкончания = НачалоДня(ДатаНачала)-1;
			ПредыдущийОбъект.Записать();
		КонецЕсли;  
	ИначеЕсли Рез.Количество() = 1 Тогда
		ОбъектОтвЛицоОрг = Рез[0].Ссылка.ПолучитьОбъект();
		ОбъектОтвЛицоОрг.Владелец = Организация;
		
		ОбъектФизЛицо = ФизЛицо.ПолучитьОбъект();
		Если ОбъектФизЛицо = Неопределено Тогда
			СоздатьФизЛицо(строка, ФизЛицо, "ОтветственныеЛица_ФизическоеЛицо_");
		Иначе
			ЗаполнитьФизЛицо(строка, ОбъектФизЛицо, "ОтветственныеЛица_ФизическоеЛицо_");
		КонецЕсли;  
		
		ОбъектОтвЛицоОрг.ФизическоеЛицо = ФизЛицо;  

		Если ЗначениеЗаполнено(Должность) Тогда
			ОбъектДолжность = Должность.ПолучитьОбъект();
			Если ОбъектДолжность = Неопределено Тогда
				СоздатьДолжность(строка,Должность,"ОтветственныеЛица_Должность_");
			Иначе
				ЗаполнитьДолжность(строка,ОбъектДолжность,"ОтветственныеЛица_Должность_");
			КонецЕсли;   
		КонецЕсли;
		ОбъектОтвЛицоОрг.ДолжностьСсылка = Должность;
		ОбъектОтвЛицоОрг.Должность = Должность.Наименование;
		ОбъектОтвЛицоОрг.ОтветственноеЛицо = ОтветственноеЛицо;
		ОбъектОтвЛицоОрг.ДатаНачала = ДатаНачала;
		ОбъектОтвЛицоОрг.Наименование = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ОбъектОтвЛицоОрг.ФизическоеЛицо, ОбъектОтвЛицоОрг.ДатаНачала);

		ОбъектОтвЛицоОрг.Записать();
		//Найти предыдущий и поставить дату окончания
		ЗапросПредыдущий = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                                |	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка
		                                |ИЗ
		                                |	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		                                |ГДЕ
		                                |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
		                                |	И ОтветственныеЛицаОрганизаций.ДатаНачала < &ДатаНачала
		                                |	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец
		                                |
		                                |УПОРЯДОЧИТЬ ПО
		                                |	ОтветственныеЛицаОрганизаций.ДатаНачала УБЫВ");
		ЗапросПредыдущий.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
		ЗапросПредыдущий.УстановитьПараметр("Владелец", Организация);
		ЗапросПредыдущий.УстановитьПараметр("ДатаНачала", ДатаНачала);
		РезПредыдущий = ЗапросПредыдущий.Выполнить().Выгрузить();
		Если РезПредыдущий.Количество() = 1 Тогда
			ПредыдущийОбъект = РезПредыдущий[0].Ссылка.ПолучитьОбъект();
			ПредыдущийОбъект.ДатаОкончания = НачалоДня(ДатаНачала)-1;
			ПредыдущийОбъект.Записать();
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьЗаполнитьДокументПриема(строка, ДокПриема)
	СтруктураРеквизитов = ПоличитьРеквизитыИзСтруктуры(строка, "ДокПриема_");
	ЗаполнитьЗначенияСвойств(ДокПриема,СтруктураРеквизитов);
	ДокПриема.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Организация));
	ДокПриема.Ответственный = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Ответственный));
	ДокПриема.НачисленияУтверждены = Истина;
	//СтруктураРеквизитовТаблицы = ПоличитьРеквизитыИзСтруктуры(строка, "ДокПриемаРаботники_");
	//НовСтрокаСотрудник = ДокПриема.Сотрудники.Добавить(); змінили документ приймач
	//ЗаполнитьЗначенияСвойств(НовСтрокаСотрудник,СтруктураРеквизитовТаблицы);
	ДокПриема.Сотрудник = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Сотрудник));
	ДокПриема.ФизическоеЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ФизЛицо));
	ДокПриема.Должность = Справочники.Должности.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Должность));
	ДокПриема.Подразделение = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ПодразделениеОрганизации));
	ДокПриема.ГрафикРаботы = Справочники.ГрафикиРаботыСотрудников.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ГрафикРаботы));
	ДокПриема.ВидЗанятости = Перечисления.ВидыЗанятости.Получить(СтруктураРеквизитов.ВидЗанятостиПорядок);
	ДокПриема.ДолжностьПоШтатномуРасписанию = ПолучитьШтатноеРасписание(Строка);
	ДокПриема.СпособРасчетаАванса = Перечисления.СпособыРасчетаАванса.РасчетомЗаПервуюПоловинуМесяца;
	Если СтруктураРеквизитов.Проведен Тогда
		ДокПриема.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокПриема.ОбменДанными.Загрузка = Истина;
		ДокПриема.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьДокумент(строка, ДокПриема)
	НовДокПриема = Документы.ПриемНаРаботу.СоздатьДокумент();
	НовДокПриема.УстановитьСсылкуНового(ДокПриема);
	СоздатьЗаполнитьДокументПриема(строка, НовДокПриема); 
КонецПроцедуры

Процедура ЗаполнитьДокумент(строка, ДокПриема)
	СоздатьЗаполнитьДокументПриема(строка, ДокПриема);
КонецПроцедуры

Функция ПолучитьHTTPОтвет(ИмяХТТПСервиса)
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL; 
	ПользовательHTTP = ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПользовательОбменаЗУП");
	ПарольПользователяHTTP = ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПарольПользователяОбменаЗУП");
	Сервер = Новый HTTPСоединение(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПутьКСерверуПубликацииHTTPСервисаОбменаHRM"),443,ПользовательHTTP,ПарольПользователяHTTP,,,ЗащищенноеСоединение);
	КлючАПИ = ПолучитьКлючAPI();
	ЗУПЗапрос = Новый HTTPЗапрос(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПутьКHTTPСервисамОбменаHRM")+"/"+ИмяХТТПСервиса+"?Api="+КлючАПИ+"&node="+ПланыОбмена.ЯЯ_ВыгрузкаИзЗУПвHRM.ЭтотУзел().Код);
	Возврат Сервер.Получить(ЗУПЗапрос);
КонецФункции

Функция ОтправитьHTTPОтвет(ИмяХТТПСервиса,Ответ)
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL; 
	ПользовательHTTP = ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПользовательОбменаЗУП");
	ПарольПользователяHTTP = ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПарольПользователяОбменаЗУП");
	Сервер = Новый HTTPСоединение(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПутьКСерверуПубликацииHTTPСервисаОбменаHRM"),443,ПользовательHTTP,ПарольПользователяHTTP,,,ЗащищенноеСоединение);
	КлючАПИ = ПолучитьКлючAPI();
	Заголовоки = Новый Соответствие;
	Заголовоки.Вставить("Content-Type","text/plain;charset=UTF-8");
	ЗУПЗапрос = Новый HTTPЗапрос(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("ПутьКHTTPСервисамОбменаHRM")+"/"+ИмяХТТПСервиса+"?Api="+КлючАПИ+"&node="+ПланыОбмена.ЯЯ_ВыгрузкаИзЗУПвHRM.ЭтотУзел().Код, Заголовоки);
	ЗУПЗапрос.УстановитьТелоИзСтроки(Ответ);
	Возврат Сервер.ОтправитьДляОбработки(ЗУПЗапрос);
КонецФункции

Процедура ПолучитьДокиПриемаПоОбмену(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMДокументыПриема"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				ДокПриема = документы.ПриемНаРаботу.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Док));
				ОбъектДокПриема = ДокПриема.ПолучитьОбъект();
				Если ОбъектДокПриема = Неопределено Тогда
					СоздатьДокумент(строка, ДокПриема);
				Иначе 
					ЗаполнитьДокумент(строка, ОбъектДокПриема);
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Документы.ПриемНаРаботуВОрганизацию";
				НовСтрокаОбработаных.УИД = Строка.УИД_Док;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСпрСотрудников(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникСотрудников"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				Сотрудник = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Сотрудник));
				ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
				Если ОбъектСотрудник = Неопределено Тогда
					СоздатьСотрудника(строка, Сотрудник);
				Иначе
					ЗаполнитьСотрудника(строка, ОбъектСотрудник);
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.СотрудникиОрганизаций";
				НовСтрокаОбработаных.УИД = Строка.УИД_Сотрудник;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена 
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСпрФизическиеЛица(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникФизЛиц"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				ФизЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ФизЛицо));
				ОбъектФизЛицо = ФизЛицо.ПолучитьОбъект();
				Если ОбъектФизЛицо = Неопределено Тогда
					СоздатьФизЛицо(строка, ФизЛицо, "ФизЛицо_");
				Иначе
					ЗаполнитьФизЛицо(строка, ОбъектФизЛицо, "ФизЛицо_");
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.ФизическиеЛица";
				НовСтрокаОбработаных.УИД = Строка.УИД_ФизЛицо;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСпрПодразделенияОрганизаций(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникПодразделенийОрг"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				ПодразделениеОрганизаций = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ПодразделениеОрганизации));
				ОбъектПодразделениеОрганизаций = ПодразделениеОрганизаций.ПолучитьОбъект();
				Если ОбъектПодразделениеОрганизаций = Неопределено Тогда
					СоздатьПодразделениеОрганизаций(строка, ПодразделениеОрганизаций);
				Иначе
					ЗаполнитьПодразделениеОрганизаций(строка, ОбъектПодразделениеОрганизаций);
				КонецЕсли; 
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.ПодразделенияОрганизаций";
				НовСтрокаОбработаных.УИД = Строка.УИД_ПодразделениеОрганизации;
				
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСпрДолжностейОрганизаций(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникДолжностейОрг"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				Должность = Справочники.Должности.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Должность));
				ОбъектДолжность = Должность.ПолучитьОбъект();
				Если ОбъектДолжность = Неопределено Тогда
					СоздатьДолжность(строка,Должность,"Должность_");
				Иначе
					ЗаполнитьДолжность(строка,ОбъектДолжность,"Должность_");
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.ДолжностиОрганизаций";
				НовСтрокаОбработаных.УИД = Строка.УИД_Должность;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСпрГрафикиРабот(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникГрафикиРаботы"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				ГрафикРаботыСотрудников = Справочники.ГрафикиРаботыСотрудников.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_ГрафикРаботы));
				ОбъектГрафикРаботы = ГрафикРаботыСотрудников.ПолучитьОбъект();
				Если ОбъектГрафикРаботы = Неопределено Тогда
					СоздатьГрафикРаботыСотрудников(строка, ГрафикРаботыСотрудников);
				Иначе
					ЗаполнитьГрафикРаботыСотрудников(строка, ОбъектГрафикРаботы);
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.ГрафикиРаботы";
				НовСтрокаОбработаных.УИД = Строка.УИД_ГрафикРаботы;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры  

Процедура ПолучитьСпрОрганизаций(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникОрганизаций"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Организация));
				ОбъектОрганизация = Организация.ПолучитьОбъект();
				Если ОбъектОрганизация = Неопределено Тогда
					СоздатьОрганизацию(строка, Организация);
				Иначе
					ЗаполнитьОрганизацию(строка, ОбъектОрганизация);
				КонецЕсли;
				Если ЗначениеЗаполнено(строка.УИД_ОтветственныеЛица_ФизическоеЛицо) Тогда
					ПроверитьОтветственныхЛицОрганизации(строка);                            
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.Организации";
				НовСтрокаОбработаных.УИД = Строка.УИД_Организация;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры  

Процедура ПолучитьСпрОтветственныхЛиц()
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникОтветственныхЛиц"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				ПроверитьОтветственныхЛицОрганизации(строка);                            
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры  

Процедура ПолучитьСпрПользователей(ТаблицаУспешноОбработаных)
	РезультатHTTP = ПолучитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMСправочникПользователей"));
	Читатель = Новый ЧтениеJSON;
	Читатель.УстановитьСтроку(РезультатHTTP.ПолучитьТелоКакСтроку());
	Если РезультатHTTP.КодСостояния = 200 Тогда
		Ответ = РезультатHTTP.ПолучитьТелоКакСтроку();
		Результат = ПрочитатьJSON(Читатель);
		Для каждого строка из Результат Цикл
			Попытка 
				Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.УИД_Ответственный));
				ОбъектПользователь = Пользователь.ПолучитьОбъект();
				Если ОбъектПользователь = Неопределено Тогда
					СоздатьПользователя(строка, Пользователь);
				Иначе
					ЗаполнитьПользователя(строка, ОбъектПользователь);
				КонецЕсли;
				НовСтрокаОбработаных = ТаблицаУспешноОбработаных.Добавить();
				НовСтрокаОбработаных.ТипЗначения = "Справочники.Пользователи";
				НовСтрокаОбработаных.УИД = Строка.Пользователи;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Иначе
		//записать ошибки обмена
	КонецЕсли;
КонецПроцедуры

Функция СериализироватьСтруктураВСтроку(СтруктураОтвета)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто,"",Истина));
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции       

Функция СформироватьОтветВJson(СтрокаОтвет, НаличиеФайла=Ложь)
	
	Если НаличиеФайла Тогда
		СтрокаОтвет = СтрЗаменить(СтрокаОтвет, "\r\n", "");
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвет, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

Процедура ОтправитьТаблицу(ТаблицаУспешноОбработаных)
	МассивДляПередачи = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаУспешноОбработаных);
	Запись = СериализироватьСтруктураВСтроку(МассивДляПередачи);
	РезультатОтправки = ОтправитьHTTPОтвет(ЯЯ_Доработки.ПолучитьПредопределенныйОбъект("HTTPСервисОбменаHRMОтправитьУспешные"), Запись);
	Если РезультатОтправки.КодСостояния = 200 Тогда
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнениеОбменаЗУПвHRM() Экспорт 
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.яя_ОбменЗУПвHRM);
	
	ТаблицаУспешноОбработаных = Новый ТаблицаЗначений;//
	ТаблицаУспешноОбработаных.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("Строка"));
	ТаблицаУспешноОбработаных.Колонки.Добавить("УИД", Новый ОписаниеТипов("Строка"));
	
	ПолучитьСпрСотрудников(ТаблицаУспешноОбработаных);
	ПолучитьСпрФизическиеЛица(ТаблицаУспешноОбработаных);
	ПолучитьСпрПодразделенияОрганизаций(ТаблицаУспешноОбработаных);
	ПолучитьСпрДолжностейОрганизаций(ТаблицаУспешноОбработаных);
	ПолучитьСпрГрафикиРабот(ТаблицаУспешноОбработаных);
	ПолучитьСпрОрганизаций(ТаблицаУспешноОбработаных);
	ПолучитьСпрОтветственныхЛиц();
	ПолучитьСпрПользователей(ТаблицаУспешноОбработаных);
	ПолучитьДокиПриемаПоОбмену(ТаблицаУспешноОбработаных);
	
	Если Не ТаблицаУспешноОбработаных.Количество()=0 Тогда
		ОтправитьТаблицу(ТаблицаУспешноОбработаных);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
